function A(x, y) {
    return y === 0
           ? 0
           : x === 0
           ? 2 * y
           : y === 1
           ? 2
           : A(x - 1, A(x, y - 1));
}

console.log(A(1, 10));
/*
->A(1,10)
->A(0,A(1,9))
->A(0,A(0,A(1,8)))
->A(0,A(0,A(0,A(1,7))))
->A(0,A(0,A(0,A(0,A(1,6))))
->A(0,A(0,A(0,A(0,A(0,A(1,5)))))
...A(0 이 9개 생기므로, 2*y를 9번 해야한다. 마지막에 A(1,1)이 되면 2를 return하므로, 그때부터 2의 10제곱이 계산된다.
즉, 계산값은 1024.(2의 10제곱)
*/
console.log(A(2, 4));
/*
=A(2,4)
=A(1,A(2,3))
=A(1,A(1,A(2,2)))
=A(1,A(1,A(1,A(2,1))))
=A(1,A(1,A(1,2)))
=A(1,A(1,A(0,A(1,1))))
=A(1,A(1,A(0,2)))
=A(1,A(1,4))
=A(1,A(0,A(1,3)))
=A(1,A(0,A(0,A(1,2))))
=A(1,A(0,A(0,A(0,A(1,1)))))
=A(1,A(0,A(0,A(0,2))))
=A(1,A(0,A(0,4)))
=A(1,A(0,8))
=A(1,16)
=A(0,A(1,15))
...
2의 16제곱.=65536
*/
console.log(A(3, 3));
/*
A(2,A(3,2))
A(2,A(2,A(3,1)))
A(2,A(2,2))
A(2,A(1,A(2,1)))
A(2,A(1,2))
A(2,4)
==2의 16제곱. = 65536
*/
function f(n) {
    return A(0, n);
}//f(n)=2*n을 나타낸다.
function g(n) {
    return A(1, n);
}//g(n)=2의 n제곱.
function h(n) {
    return A(2, n);
}//h(n)=2의 h(n-1)제곱.
function k(n) {
   return 5 * n * n;
}


console.log(f(4));
console.log(g(4));
console.log(h(4));
console.log(k(4));